i just tried version `4.33.0` and it works. it was failing for me before (`4.12.1`). my global-datasore and both primary and secondary are new clusters. i have the basic setup right now -
```
 resource "aws_elasticache_global_replication_group" "elasticache_global" {
   global_replication_group_id_suffix = "preprod-test-elasticache-01"
   primary_replication_group_id       = aws_elasticache_replication_group.primary.id
 }

 resource "aws_elasticache_replication_group" "primary" {
   replication_group_id = "preprod-test-elasticache-01-us-east-2"
   description          = "primary replication group"

   engine               = "redis"
   engine_version       = "6.2"
   node_type            = "cache.m6g.large"

   auto_minor_version_upgrade = true

   num_cache_clusters   = 2
 }

 resource "aws_elasticache_replication_group" "secondary" {
   provider                    = aws.oregon

   replication_group_id        = "preprod-test-elasticache-01-us-west-2"
   description                 = "secondary replication group"
   global_replication_group_id = aws_elasticache_global_replication_group.elasticache_global.global_replication_group_id

   num_cache_clusters          = 1
 }
```

apply -
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_global_replication_group.elasticache_global will be created
  + resource "aws_elasticache_global_replication_group" "elasticache_global" {
      + arn                                = (known after apply)
      + at_rest_encryption_enabled         = (known after apply)
      + auth_token_enabled                 = (known after apply)
      + cache_node_type                    = (known after apply)
      + cluster_enabled                    = (known after apply)
      + engine                             = (known after apply)
      + engine_version                     = (known after apply)
      + engine_version_actual              = (known after apply)
      + global_replication_group_id        = (known after apply)
      + global_replication_group_id_suffix = "preprod-test-elasticache-01"
      + id                                 = (known after apply)
      + primary_replication_group_id       = (known after apply)
      + transit_encryption_enabled         = (known after apply)
    }

  # aws_elasticache_replication_group.primary will be created
  + resource "aws_elasticache_replication_group" "primary" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = "true"
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "primary replication group"
      + engine                         = "redis"
      + engine_version                 = "6.2"
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = "cache.m6g.large"
      + num_cache_clusters             = 2
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = (known after apply)
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = "preprod-test-elasticache-01-us-east-2"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = (known after apply)
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

  # aws_elasticache_replication_group.secondary will be created
  + resource "aws_elasticache_replication_group" "secondary" {
      + apply_immediately              = (known after apply)
      + arn                            = (known after apply)
      + at_rest_encryption_enabled     = (known after apply)
      + auto_minor_version_upgrade     = (known after apply)
      + automatic_failover_enabled     = false
      + cluster_enabled                = (known after apply)
      + configuration_endpoint_address = (known after apply)
      + data_tiering_enabled           = (known after apply)
      + description                    = "secondary replication group"
      + engine                         = "redis"
      + engine_version                 = (known after apply)
      + engine_version_actual          = (known after apply)
      + global_replication_group_id    = (known after apply)
      + id                             = (known after apply)
      + maintenance_window             = (known after apply)
      + member_clusters                = (known after apply)
      + multi_az_enabled               = false
      + node_type                      = (known after apply)
      + num_cache_clusters             = 1
      + num_node_groups                = (known after apply)
      + number_cache_clusters          = (known after apply)
      + parameter_group_name           = (known after apply)
      + primary_endpoint_address       = (known after apply)
      + reader_endpoint_address        = (known after apply)
      + replicas_per_node_group        = (known after apply)
      + replication_group_description  = (known after apply)
      + replication_group_id           = "preprod-test-elasticache-01-us-west-2"
      + security_group_ids             = (known after apply)
      + security_group_names           = (known after apply)
      + snapshot_window                = (known after apply)
      + subnet_group_name              = (known after apply)
      + tags_all                       = (known after apply)
      + transit_encryption_enabled     = (known after apply)

      + cluster_mode {
          + num_node_groups         = (known after apply)
          + replicas_per_node_group = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
...
Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

re-run with minor changes -
```
Terraform will perform the following actions:

  # aws_elasticache_replication_group.primary will be updated in-place
  ~ resource "aws_elasticache_replication_group" "primary" {
      + apply_immediately             = true
      ~ auto_minor_version_upgrade    = "false" -> "true"
        id                            = "preprod-test-elasticache-01-us-east-2"
      ~ tags                          = {
          + "infra" = "terraform"
        }
      ~ tags_all                      = {
          + "infra" = "terraform"
        }
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_elasticache_replication_group.secondary will be updated in-place
  ~ resource "aws_elasticache_replication_group" "secondary" {
      + apply_immediately             = true
      ~ auto_minor_version_upgrade    = "false" -> "true"
        id                            = "preprod-test-elasticache-01-us-west-2"
      ~ member_clusters               = [
          - "preprod-test-elasticache-01-us-west-2-001",
        ] -> (known after apply)
      ~ num_cache_clusters            = 1 -> 2
      ~ tags                          = {
          + "infra" = "terraform"
        }
      ~ tags_all                      = {
          + "infra" = "terraform"
        }
        # (29 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
...
Error: error updating ElastiCache Replication Group (preprod-test-elasticache-01-us-east-2): InvalidParameterValue: Cluster [preprod-test-elasticache-01-us-east-2] is part of a global cluster [fpkhr-preprod-test-elasticache-01]. Request rejected.
...
Error: error updating ElastiCache Replication Group (preprod-test-elasticache-01-us-west-2): InvalidParameterValue: Cluster [preprod-test-elasticache-01-us-west-2] is part of a global cluster [fpkhr-preprod-test-elasticache-01]. Request rejected.
```

2nd apply not so good. :-\